# RcsReinforcedCrossSectionImportData

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**setting** | **RcsReinforcedCrosssSectionImportSetting** |  | [optional]
**template** | **str** |  | [optional]

## Example

```python
from ideastatica_rcs_api.models.rcs_reinforced_cross_section_import_data import RcsReinforcedCrossSectionImportData

# TODO update the JSON string below
json = "{}"
# create an instance of RcsReinforcedCrossSectionImportData from a JSON string
rcs_reinforced_cross_section_import_data_instance = RcsReinforcedCrossSectionImportData.from_json(json)
# print the JSON string representation of the object
print(rcs_reinforced_cross_section_import_data_instance.to_json())

# convert the object into a dict
rcs_reinforced_cross_section_import_data_dict = rcs_reinforced_cross_section_import_data_instance.to_dict()
# create an instance of RcsReinforcedCrossSectionImportData from a dict
rcs_reinforced_cross_section_import_data_from_dict = RcsReinforcedCrossSectionImportData.from_dict(rcs_reinforced_cross_section_import_data_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)